tsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="warning">

  <clients>
    <client host="localhost" use_controller_vm='true' maxusers="30000" />
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="minute">
      <users arrivalrate="5000" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
    <session name="simple" weight="0.6" type="ts_http">
      <request>
      <http url="/graphql?id=a"
              method="GET"
               />
      </request>
    </session>
    <session name="simple" weight="0.4" type="ts_http">
      <request>
      <http url="/graphql?id=b"
              method="GET"
               />
      </request>
    </session>
  </sessions>
</tsung>